


function ToDoItem(props) {
    // console.log(props)
    return (
        <li>
            {props.text}
            <button onClick={() => { props.delCallback() }}>X</button>
        </li>);
}

export default ToDoItem;
/*


function component для айтема (лі з текстом + кнопкою)

За натиском на кнопку лі зникає з екрану

1. Зробити функціональну компоненту.
2. Винести в цю функцінальну компоненту <li>
3. Переписати логіку відмальування лішки так, що дані тепер будуть спускатись від батька через пропси
4. Зробити колбек в батьківського елемента, який має отримати id на вхід та видалити зі стейта елемент з такми id
5. В компоненті TodoItem зробити виклик колбека і передати йому id (за нтиснення на кнопку)
*/